from task_2_queen import *
# from modul_date_2 import *
from modul_numbers_2 import *
from modul_riddles_2 import *

if __name__ == '__main__':
    print(is_queen_beat([[1, 1], [5, 2], [8, 3], [6, 4], [3, 5], [7, 6], [2, 7], [4, 8]]))
    #функция определяет успешно ли расставлены ферзи на доске 8*8
    successful_position(4)
    # функция вывода n успешных расстановок ферзей на доске 8*8

'''
вывод  функции successful_position(4):
[[5, 2], [3, 5], [8, 3], [2, 7], [4, 8], [6, 4], [1, 1], [7, 6]]  iter = 31591340
[[2, 4], [7, 3], [1, 7], [8, 5], [4, 8], [6, 1], [5, 6], [3, 2]]  iter = 41559817
[[8, 3], [7, 6], [3, 7], [6, 8], [2, 2], [1, 4], [5, 1], [4, 5]]  iter = 44096729
[[8, 5], [1, 2], [7, 7], [2, 4], [3, 6], [5, 3], [6, 1], [4, 8]]  iter = 96825221
'''